package day08;

public class d8class01 {

	public static void main(String[] args) {
		/* d8 클래스 객체지향언어
		 * 절차지향언어 : 순서에 초점을 맞춤
		 * 			    복사를 하고 싶다
		 * 			    복사하는 메소드를 만들어서 사용해라
		 * 객체지향언어 : 객체와 순서에 초점을 맞춤
		 * 			    복사를 하고 싶다
		 * 			    복사기 설계도(클래스)를 이용해서 복사기(객체)를 만들고
		 * 			    복사기능(메서드)을 이용하여 복사해라
		
		 * 클래스는 멤버변수와 멤버메서드로 이루어짐
		 * 정보를 편하게 관리하기 위해서 클래스를 생성
		 * 클래스 : 설계도
		 * 객체(인스턴스) : 제품
		 * 메서드 : 기능
		 * 클래스 : 멤버변수, 멤버메서드
		 * 클래스 객체명 = new 클래스();
		 * 객체명.멤버변수;
		 * 객체명.멤버메서드;
		 * 주로 멤버변수는 private, 멤버메서드는 public 으로 설정
		 
		 * 접근제한자의 종류
		 * public > default > protected > private
		 * - 접근제한자 : public
		 * 전부, 아무나 접근 가능
		 * 클래스에 public을 붙일수 있는 경우는 단 하나
		 * public로 접근제한자를 설정하려면 클래스명과 파일명이 동일해야한다
		 * 일반적으로 맴버메서드를  public으로 설정한다
		
		 * - 접근제한자 : protected
		 * 본인 + 자식(파생)클래스만 접근 가능
		
		 * - 접근제한자 : default
		 * 같은 패키지안에서만 접근 가능
		 * default 라고 적혀있는 것이 아니라
		 * 클래스나 메서드에 접근제한자를 명시하지 않은 경우를 default 라고 명칭 

		 * - 접근제한자 : private
		 * 본인만 접근 가능
		 * 해당 메서드를 포함하는 클래스를 제외한 다른 클래스에서 사용할수 없다
		 * 일반적으로 멤버변수를 private으로 설정한다
		 */
		
	}

}
