package day01;

public class d1ex02 {

	public static void main(String[] args) {
		/* d1 변수 명명규칙
		 * 대소문자가 구분되며 길이에 제한이 없다
		 * 숫자로 시작해서는 안된다
		 * 특수문자는 _와 $만을 허용한다
		 * 예약어를 사용해서는 안된다
		 * 공백, 중불 사용은 안된다

		 * 관례
		 * 클래스 이름의 첫 글자는 항상 대문자
		 * 자주쓰는 단어는 약어를 통해서 사용, 해당 변수 이름만 보고 유추할수 있는 이름이 좋다
		 * 여러단어로 이루어진 변수명의 뒷글자는 대문자로 표기
		 * 상수의 이름은 모두 대문자로 하고 여러 글자로 이루어진 경우_로 구분한다

		 * 상수 : 저장하면 변경할수 없는 값, 값을 한번만 저장할 수 있는 공간
		 * 앞에 final을 붙이고 항상 초기값이 필요
		 * 리터럴 : 그 자체로 값을 의미하는 것
		 */

		final int MAX_SIZE = 10;
		final char PLUS = '+';

	}

}
